In [2]:
import pandas as pd

In [3]:
details={
    'col1':[1,3,5,7,9],
    'col2':[7,4,35,14,56]
}

In [6]:
df=pd.DataFrame(details)

In [7]:
df

   col1  col2
0     1     7
1     3     4
2     5    35
3     7    14
4     9    56

In [9]:
df['col1'].mean()

5.0

In [8]:
df['col1']-df['col1'].mean()

0   -4.0
1   -2.0
2    0.0
3    2.0
4    4.0
Name: col1, dtype: float64

In [10]:
(df['col1']-df['col1'].mean())/df['col1'].std()

0   -1.264911
1   -0.632456
2    0.000000
3    0.632456
4    1.264911
Name: col1, dtype: float64

In [11]:
df['Z_col1']=(df['col1']-df['col1'].mean())/df['col1'].std()

In [12]:
df

   col1  col2    Z_col1
0     1     7 -1.264911
1     3     4 -0.632456
2     5    35  0.000000
3     7    14  0.632456
4     9    56  1.264911

In [13]:
df['Z_col2']=(df['col2']-df['col2'].mean())/df['col2'].std()

In [14]:
df

   col1  col2    Z_col1    Z_col2
0     1     7 -1.264911 -0.737355
1     3     4 -0.632456 -0.873902
2     5    35  0.000000  0.537085
3     7    14  0.632456 -0.418745
4     9    56  1.264911  1.492915